---
kind: property
id: P:Autodesk.Revit.DB.UpdaterInfo.IsOptional
source: html/49812760-4c9f-e8a6-0674-dcd4cc3c8eeb.htm
---
# Autodesk.Revit.DB.UpdaterInfo.IsOptional Property

Whether the updater is optional or not.

## Syntax (C#)
```csharp
public bool IsOptional { get; }
```